src/Documents/УстановкаКоличестваДнейОтпуска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>УстановкаКоличестваДнейОтпуска</Name>
			<Comment>(Регл)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОтпускаПоТрудовымДоговорам</xr:Item>
				<xr:Item>InformationRegister.ОтпускаПоСотрудникам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнестиИзмененияПоОтпуску</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНеявокС</Name>
					<Comment>начальная дата периода неявок ( для выполнения смещения рабочего года отпускного периода ), Свэй, Задача СВФР-002169</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНеявокПО</Name>
					<Comment>конечная дата периода неявок ( для выполнения смещения рабочего года отпускного периода ), Свэй, Задача СВФР-002169</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РаботникиОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Физлицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзменения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаНов</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияНов</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Отпуска</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОтпуска</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЕжегодныхОтпусков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочийГодС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочийГодПо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочийГодСНов</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочийГодПоНов</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовоеКоличествоДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ОтпускаПоСотрудникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОтпускаПоСотрудникам</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОтпуска</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЕжегодныхОтпусков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СостояниеРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостояниеРаботниковОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияРаботникаОрганизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияРаботникаОрганизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/ОтпускаПоТрудовымДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОтпускаПоТрудовымДоговорам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Корректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОтпуска</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЕжегодныхОтпусков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ПричиныИзмененияСостояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПричиныИзмененияСостояния</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриемНаРаботу</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/УстановкаКоличестваДнейОтпуска/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем мДлинаСуток;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// 04.02.2011 Дмитрук О.Г.


Функция СформироватьЗапросПоОтпускамДолжностей(Сотрудник, Подразделение, ДатаИзменения) Экспорт

	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ОтпускаПоСотрудникамСрезПоследних.Сотрудник,
	|	ОтпускаПоСотрудникамСрезПоследних.ВидОтпуска,
	|	ОтпускаПоСотрудникамСрезПоследних.Подразделение,
	|	ОтпускаПоСотрудникамСрезПоследних.Должность,
	|	ОтпускаПоСотрудникамСрезПоследних.КоличествоДней,
	|	УстановкаКоличестваДнейОтпускаРаботникиОрганизации.ДатаНачала,
	|	УстановкаКоличестваДнейОтпускаРаботникиОрганизации.ДатаОкончания
	|ИЗ
	|	РегистрСведений.ОтпускаПоСотрудникам.СрезПоследних(&Период, ) КАК ОтпускаПоСотрудникамСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УстановкаКоличестваДнейОтпуска.РаботникиОрганизации КАК УстановкаКоличестваДнейОтпускаРаботникиОрганизации
	|		ПО ОтпускаПоСотрудникамСрезПоследних.Регистратор = УстановкаКоличестваДнейОтпускаРаботникиОрганизации.Ссылка
	|			И ОтпускаПоСотрудникамСрезПоследних.Сотрудник = УстановкаКоличестваДнейОтпускаРаботникиОрганизации.Сотрудник
	|ГДЕ
	|	ОтпускаПоСотрудникамСрезПоследних.Сотрудник = &Сотрудник
	|	И ОтпускаПоСотрудникамСрезПоследних.Подразделение = &Подразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтпускаПоСотрудникамСрезПоследних.Подразделение,
	|	ОтпускаПоСотрудникамСрезПоследних.ВидОтпуска,
	|	ОтпускаПоСотрудникамСрезПоследних.Сотрудник,
	|	ОтпускаПоСотрудникамСрезПоследних.Должность,
	|	ОтпускаПоСотрудникамСрезПоследних.КоличествоДней,
	|	УстановкаКоличестваДнейОтпускаРаботникиОрганизации.ДатаНачала,
	|	УстановкаКоличестваДнейОтпускаРаботникиОрганизации.ДатаОкончания
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОтпускаПоСотрудникамСрезПоследних.ВидОтпуска.Код";
	
	Запрос.УстановитьПараметр("Период", ДатаИзменения);
	Запрос.УстановитьПараметр("Сотрудник",Сотрудник);  
	Запрос.УстановитьПараметр("Подразделение",Подразделение);  	
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Количество() = 0 Тогда
		Запрос = Новый Запрос;
		
		// Установим параметры запроса
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РаботникиОрганизацийСрезПоследних.Сотрудник,
		|	РаботникиОрганизацийСрезПоследних.Должность,
		|	ДолжностиОрганизацийОтпуск.ВидОтпуска,
		|	ДолжностиОрганизацийОтпуск.КоличествоДней,
		|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ДатаНачала,
		|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ДатаОкончания
		|ИЗ
		|	Справочник.ДолжностиОрганизаций.Отпуск КАК ДолжностиОрганизацийОтпуск
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РаботникиОрганизацийСрезПоследних
		|		ПО ДолжностиОрганизацийОтпуск.Ссылка = РаботникиОрганизацийСрезПоследних.Должность
		|			И ДолжностиОрганизацийОтпуск.ПодразделениеОтпуск = РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации
		|ГДЕ
		|	РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник
		|	И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации = &Подразделение
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДолжностиОрганизацийОтпуск.ВидОтпуска.Код";
		
		
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
		Запрос.УстановитьПараметр("Период", ДатаИзменения);
		
		Результат = Запрос.Выполнить().Выбрать();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // СформироватьЗапросПоОтпускамДолжностей()
 

Функция Автозаполнение(ТаблицаРаботники = Неопределено) Экспорт //Аверсон ЕАЕ 09.10.2021 СВФР-008217 параметр ТаблицаРаботники
	
 	Запрос = Новый Запрос;
	// создаем временную таблицу ВТСписокРаботников с сотрудниками, отобранными по критериям пользователя 
	// 
	// Поля:
	//   Сотрудник
	//   Физлицо
	//   ФИО
	//   ПодразделениеОрганизации
	//   Должность
	//
	
	Отпуска.Очистить();
	РаботникиОрганизации.Очистить();
	
	Если ТаблицаРаботники = Неопределено Тогда //Аверсон ЕАЕ 09.10.2021 СВФР-008217
		ТекстЗапроса =
	"ВЫБРАТЬ
	|	РаботникиОрганизаций.Сотрудник КАК Сотрудник,
	|	РаботникиОрганизаций.Сотрудник.Код КАК СотрудникКод,
	|	РаботникиОрганизаций.Должность,
	|	РаботникиОрганизаций.ПодразделениеОрганизации КАК Подразделение,
	|	РаботникиОрганизаций.Сотрудник.Физлицо
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&НачалоМесяца, Организация = &ГоловнаяОрганизация) КАК РаботникиОрганизаций
	|ГДЕ
	|	РаботникиОрганизаций.Организация = &ГоловнаяОрганизация
	|	И РаботникиОрганизаций.ОбособленноеПодразделение = &ОбособленноеПодразделение
	|	//И РаботникиОрганизаций.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)
	|	И РаботникиОрганизаций.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение) //Аверсон 25.09.2019 КВВ СВФР-004762
	
	|УПОРЯДОЧИТЬ ПО
	|	Подразделение,
	|	СотрудникКод";
	
  	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("ОбособленноеПодразделение", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("ПустоеПодразделение", Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	Запрос.УстановитьПараметр("Подразделение", ПодразделениеОрганизации);
    Запрос.УстановитьПараметр("НачалоМесяца", Дата);
	
	Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
    	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И РаботникиОрганизаций.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)","И РаботникиОрганизаций.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)")
	КонецЕсли;

	Запрос.Текст = ТекстЗапроса;
	РезультатВыборка = Запрос.Выполнить().Выбрать();

	Пока РезультатВыборка.Следующий() Цикл
		НоваяСтрока = РаботникиОрганизации.Добавить();
		НоваяСтрока.Сотрудник = РезультатВыборка.Сотрудник;
		НоваяСтрока.Физлицо = РезультатВыборка.Сотрудник.ФизЛицо;
		НоваяСтрока.Подразделение = РезультатВыборка.Подразделение;
		НоваяСтрока.Должность = РезультатВыборка.Должность;
		НоваяСтрока.ДатаИзменения = Дата;

		КолДней = 0;
		Результат = СформироватьЗапросПоОтпускамДолжностей(РезультатВыборка.Сотрудник, РезультатВыборка.Подразделение, НоваяСтрока.ДатаИзменения);
		Пока Результат.Следующий() Цикл
			НоваяСтрОтпуск = Отпуска.Добавить();
			НоваяСтрОтпуск.Сотрудник = РезультатВыборка.Сотрудник;
			НоваяСтрОтпуск.ВидОтпуска = Результат.ВидОтпуска;
			НоваяСтрОтпуск.КоличествоДней = Результат.КоличествоДней;
			КолДней = КолДней + Результат.КоличествоДней;
			//Островская Татьяна 12.02.2014 № 17108
			НоваяСтрока.ДатаНачала = Результат.ДатаНачала;
			НоваяСтрока.ДатаОкончания = Результат.ДатаОкончания;
            //Островская Татьяна 12.02.2014 № 17108
		КонецЦикла;
		
		НоваяСтрока.КоличествоДней = КолДней;
	КонецЦикла;
	
	//Аверсон ЕАЕ 09.10.2021 СВФР-008217
	Иначе
		Для Каждого РезультатВыборка Из ТаблицаРаботники Цикл
			НоваяСтрока = РаботникиОрганизации.Добавить();
			НоваяСтрока.Сотрудник = РезультатВыборка.Сотрудник;
			НоваяСтрока.Физлицо = РезультатВыборка.Сотрудник.ФизЛицо;
			НоваяСтрока.Подразделение = РезультатВыборка.Подразделение;
			НоваяСтрока.Должность = РезультатВыборка.Должность;
			НоваяСтрока.ДатаИзменения = Дата;
			
			КолДней = 0;
			Результат = СформироватьЗапросПоОтпускамДолжностей(РезультатВыборка.Сотрудник, РезультатВыборка.Подразделение, НоваяСтрока.ДатаИзменения);
			Пока Результат.Следующий() Цикл
				НоваяСтрОтпуск = Отпуска.Добавить();
				НоваяСтрОтпуск.Сотрудник = РезультатВыборка.Сотрудник;
				НоваяСтрОтпуск.ВидОтпуска = Результат.ВидОтпуска;
				НоваяСтрОтпуск.КоличествоДней = Результат.КоличествоДней;
				КолДней = КолДней + Результат.КоличествоДней;
				НоваяСтрока.ДатаНачала = Результат.ДатаНачала;
				НоваяСтрока.ДатаОкончания = Результат.ДатаОкончания;
			КонецЦикла;
			
			НоваяСтрока.КоличествоДней = КолДней;
		КонецЦикла;	
		
	КонецЕсли;
	//Аверсон СВФР-008217
	
КонецФункции //Автозаполнение()

//(начало) добавлено Кухарчуком Д.Я. 14.09.18, Задача СВФР-002169
//заполняет табличные части "РаботникиОрганизации" И "Отпуска" 
//списком сотрудников и списком отпусков, соответственно, со смещенным рабочим годом
Процедура СместитьРабочийГодЗаполнить( Сотрудник = Неопределено ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	    |// 0
	    |ВЫБРАТЬ
		|	Состояния.Сотрудник, 
		|	НАЧАЛОПЕРИОДА( МИНИМУМ( Состояния.Период ), ДЕНЬ ) КАК ДатаНачалаОтпуска,
		|	КОНЕЦПЕРИОДА( МАКСИМУМ( Состояния.ПериодЗавершения ), ДЕНЬ ) КАК ДатаОкончанияОтпуска
		|ПОМЕСТИТЬ ВтДатыОкончанияПрошлыхОтпусковПоУходуЗаРебенком
		|ИЗ
		|	РегистрСведений.СостояниеРаботниковОрганизаций КАК Состояния
		|ГДЕ
		//+ СВЭЙ КДЯ 12.12.19 СВФР-005183 +
		//|	Состояния.ПериодЗавершения МЕЖДУ &ПериодНеявокНачало И &ПериодНеявокКонец
		//|   		И Состояния.Период <= Состояния.ПериодЗавершения И 
		//- СВЭЙ КДЯ 12.12.19 СВФР-004448
		|			Состояния.Состояние = ЗНАЧЕНИЕ( Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком )
		|			И Состояния.Организация = &ГоловнаяОрганизация
		|" + ?( ЗначениеЗаполнено(Сотрудник), "			И Состояния.Сотрудник = &Сотрудник", "" ) + "
		|СГРУППИРОВАТЬ ПО
		|	Состояния.Сотрудник
		|;
		|
	    |// 1
		|ВЫБРАТЬ
		|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
		|	РаботникиОрганизацийСрезПоследних.Должность КАК Должность,
		|	ОтпускаПоТрудовымДоговорам.Сотрудник КАК Сотрудник,	
		|	ОтпускаПоТрудовымДоговорам.ВидОтпуска КАК ВидОтпуска,
		|	ОтпускаПоТрудовымДоговорам.Период КАК ДатаНачала,
		|	ОтпускаПоТрудовымДоговорам.ДатаОкончания,
		|		СУММА( ВЫБОР КОГДА ОтпускаПоТрудовымДоговорам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 
		|						ТОГДА ОтпускаПоТрудовымДоговорам.КоличествоДней 
		|						ИНАЧЕ - ОтпускаПоТрудовымДоговорам.КоличествоДней 
		|			   КОНЕЦ ) КАК КоличествоДней
		|	ПОМЕСТИТЬ ВтОтпускаПоТрудовымДоговорамИсходные
		|ИЗ
		|	РегистрНакопления.ОтпускаПоТрудовымДоговорам КАК ОтпускаПоТрудовымДоговорам
		|
		|       ЛЕВОЕ СОЕДИНЕНИЕ ВтДатыОкончанияПрошлыхОтпусковПоУходуЗаРебенком КАК ВтДатыОкончанияПрошлыхОтпусковПоУходуЗаРебенком
		|			ПО ОтпускаПоТрудовымДоговорам.Сотрудник = ВтДатыОкончанияПрошлыхОтпусковПоУходуЗаРебенком.Сотрудник
		//+ СВЭЙ КДЯ 19.12.19 СВФР-005183
		| 				И ОтпускаПоТрудовымДоговорам.ДатаОкончания >= ВтДатыОкончанияПрошлыхОтпусковПоУходуЗаРебенком.ДатаНачалаОтпуска
		|				И ОтпускаПоТрудовымДоговорам.Период <= ВтДатыОкончанияПрошлыхОтпусковПоУходуЗаРебенком.ДатаОкончанияОтпуска
		//- СВЭЙ КДЯ 12.12.19 СВФР-005183
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|				&Дата,
		|				Организация = &ГоловнаяОрганизация
		|" + ?( ЗначениеЗаполнено(Сотрудник), "
		|				И Сотрудник = &Сотрудник", "" ) + "
		|" + ?( НЕ ЗначениеЗаполнено(Сотрудник) И ЗначениеЗаполнено(ПодразделениеОрганизации), " 
		|				И ПодразделениеОрганизации В ИЕРАРХИИ (&ПодразделениеОрганизации)
		|", "" ) + "
		|					) КАК РаботникиОрганизацийСрезПоследних
		|		ПО ОтпускаПоТрудовымДоговорам.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
		|			И НЕ РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций
		|
		|ГДЕ
		|  ( ВтДатыОкончанияПрошлыхОтпусковПоУходуЗаРебенком.ДатаНачалаОтпуска IS NULL
		|		И ОтпускаПоТрудовымДоговорам.ДатаОкончания >= &ПериодНеявокНачало
		|		И ОтпускаПоТрудовымДоговорам.Период <= &ПериодНеявокКонец
		|    ИЛИ
		|    НЕ ВтДатыОкончанияПрошлыхОтпусковПоУходуЗаРебенком.ДатаНачалаОтпуска IS NULL
		|		И 
		//+ СВЭЙ КДЯ 12.12.19 СВФР-005183
		//|		 ( ВтДатыОкончанияПрошлыхОтпусковПоУходуЗаРебенком.ДатаНачалаОтпуска МЕЖДУ
		//|				ОтпускаПоТрудовымДоговорам.Период
		//|				И ОтпускаПоТрудовымДоговорам.ДатаОкончания
		//|           ИЛИ
		//|			ОтпускаПоТрудовымДоговорам.ДатаОкончания >= &ПериодНеявокНачало
		//|			И ОтпускаПоТрудовымДоговорам.Период <= &ПериодНеявокКонец
		//|         )
		//- СВЭЙ КДЯ 12.12.19 СВФР-005183
		//+ СВЭЙ КДЯ 12.12.19 СВФР-005183 +
		|			ВтДатыОкончанияПрошлыхОтпусковПоУходуЗаРебенком.ДатаОкончанияОтпуска МЕЖДУ &ПериодНеявокНачало И &ПериодНеявокКонец
		//+ СВЭЙ КДЯ 19.12.19 СВФР-005183
		//| 		И ОтпускаПоТрудовымДоговорам.ДатаОкончания >= ВтДатыОкончанияПрошлыхОтпусковПоУходуЗаРебенком.ДатаНачалаОтпуска
		//|			И ОтпускаПоТрудовымДоговорам.Период <= ВтДатыОкончанияПрошлыхОтпусковПоУходуЗаРебенком.ДатаОкончанияОтпуска
		//- СВЭЙ КДЯ 19.12.19 СВФР-005183
		//- СВЭЙ КДЯ 12.12.19 СВФР-005183
		|   )
		|	И ОтпускаПоТрудовымДоговорам.Регистратор <> &Регистратор
		|СГРУППИРОВАТЬ ПО
		|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
		|	РаботникиОрганизацийСрезПоследних.Должность,
		|	ОтпускаПоТрудовымДоговорам.Сотрудник,	
		|	ОтпускаПоТрудовымДоговорам.ВидОтпуска,
		|	ОтпускаПоТрудовымДоговорам.Период,
		|	ОтпускаПоТрудовымДоговорам.ДатаОкончания
		|;
		|
	    |// 2
		|ВЫБРАТЬ
		|	ОтпускаПоТрудовымДоговорам.ПодразделениеОрганизации,
		|	ОтпускаПоТрудовымДоговорам.Должность,
		|	ОтпускаПоТрудовымДоговорам.Сотрудник КАК Сотрудник,	
		|	ОтпускаПоТрудовымДоговорам.ВидОтпуска КАК ВидОтпуска,
		|	ОтпускаПоТрудовымДоговорам.ДатаНачала,
		|	ОтпускаПоТрудовымДоговорам.ДатаОкончания,
		|	ОтпускаПоТрудовымДоговорам.КоличествоДней КАК КоличествоДней
		|	ПОМЕСТИТЬ ВтОтпускаПоТрудовымДоговорам
		|ИЗ
		|	ВтОтпускаПоТрудовымДоговорамИсходные КАК ОтпускаПоТрудовымДоговорам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОтпускаПоТрудовымДоговорам КАК ОтпускаПоТрудовымДоговорамСторно
		|			ПО ОтпускаПоТрудовымДоговорам.Сотрудник = ОтпускаПоТрудовымДоговорамСторно.Сотрудник
		|			И ОтпускаПоТрудовымДоговорам.ВидОтпуска = ОтпускаПоТрудовымДоговорамСторно.ВидОтпуска
		|			И ОтпускаПоТрудовымДоговорам.ДатаНачала = ОтпускаПоТрудовымДоговорамСторно.Период
		|			И ОтпускаПоТрудовымДоговорам.КоличествоДней = ОтпускаПоТрудовымДоговорамСторно.КоличествоДней
		|			И ОтпускаПоТрудовымДоговорам.ДатаОкончания >= ОтпускаПоТрудовымДоговорамСторно.ДатаОкончания
		|			И (ОтпускаПоТрудовымДоговорамСторно.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
		|			И (ОтпускаПоТрудовымДоговорамСторно.Корректировка)
		|			И (ОтпускаПоТрудовымДоговорамСторно.Регистратор <> &Регистратор)
		|			И (НЕ ОтпускаПоТрудовымДоговорамСторно.Регистратор ССЫЛКА Документ.ТрудовойДоговор)
		|ГДЕ
		|	ОтпускаПоТрудовымДоговорамСторно.Сотрудник ЕСТЬ NULL
		
		//Аверсон ЕАЕ 08.01.2025 СВФР-014223
		|   ИЛИ ОтпускаПоТрудовымДоговорамСторно.Регистратор ССЫЛКА Документ.УстановкаКоличестваДнейОтпуска
		//Аверсон СВФР-014223
		
		|;
		|
	    |// 3
	    |ВЫБРАТЬ
		|	Состояния.Сотрудник, КОНЕЦПЕРИОДА( МАКСИМУМ( Состояния.ПериодЗавершения ), ДЕНЬ ) КАК ДатаОкончанияОтпуска
		|ПОМЕСТИТЬ ВтДатыОкончанияОтпусковПоУходуЗаРебенком
		|ИЗ
		|	РегистрСведений.СостояниеРаботниковОрганизаций КАК Состояния
		|   ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОтпускаПоТрудовымДоговорам КАК Отпуска
		|   	ПО
		//+ СВЭЙ КДЯ 12.12.19 СВФР-005183
		//|			Состояния.Период МЕЖДУ Отпуска.ДатаНачала И Отпуска.ДатаОкончания
		//- СВЭЙ КДЯ 12.12.19 СВФР-005183
		//+ СВЭЙ КДЯ 12.12.19 СВФР-005183
 		|			Отпуска.ДатаОкончания >= Состояния.Период
		|			И Отпуска.ДатаНачала <= Состояния.ПериодЗавершения
		//- СВЭЙ КДЯ 12.12.19 СВФР-005183
		|   		И Состояния.Сотрудник = Отпуска.Сотрудник
		|   		И Состояния.Период <= Состояния.ПериодЗавершения
		|			И Состояния.Состояние = ЗНАЧЕНИЕ( Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком )
		|			И Состояния.Организация = &ГоловнаяОрганизация
		|СГРУППИРОВАТЬ ПО
		|	Состояния.Сотрудник
		|;
		|
	    |// 4
		|ВЫБРАТЬ
		|	ОтпускаПоТрудовымДоговорам.ПодразделениеОрганизации,
		|	ОтпускаПоТрудовымДоговорам.Должность,
		|	ОтпускаПоТрудовымДоговорам.Сотрудник КАК Сотрудник,
		|	СУММА(ВЫБОР
		|			КОГДА Состояния.Состояние = ЗНАЧЕНИЕ( Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком )
		|				ТОГДА РАЗНОСТЬДАТ(
		|							Состояния.Период, 
		|							Состояния.ПериодЗавершения, 
		|							ДЕНЬ ) //+ 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СмещениеВДняхИззаОтпускаПоУходуЗаРебенком,
		|	СУММА(ВЫБОР
		|			КОГДА Состояния.Состояние <> ЗНАЧЕНИЕ( Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком )
		|				ТОГДА РАЗНОСТЬДАТ(
		|							Состояния.Период, 
		|							Состояния.ПериодЗавершения, 
		|							ДЕНЬ ) //+ 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) - 14 КАК СмещениеВДняхИззаОтпускаЗаСвойСчет,
		|	ОтпускаПоТрудовымДоговорам.Сотрудник.Физлицо КАК ФизЛицо,
		|	&Дата КАК ДатаИзменения,
		|	ОтпускаПоТрудовымДоговорам.КоличествоДней КАК КоличествоДней,
		|	ОтпускаПоТрудовымДоговорам.ДатаНачала,
		|	ОтпускаПоТрудовымДоговорам.ДатаОкончания,
		|	ОтпускаПоТрудовымДоговорам.ВидОтпуска
		|ПОМЕСТИТЬ ВтСмещения
		|ИЗ
		|    ВтОтпускаПоТрудовымДоговорам КАК ОтпускаПоТрудовымДоговорам
		|
		|       ЛЕВОЕ СОЕДИНЕНИЕ ВтДатыОкончанияОтпусковПоУходуЗаРебенком КАК ВтДатыОкончанияОтпусковПоУходуЗаРебенком
		|			ПО ОтпускаПоТрудовымДоговорам.Сотрудник = ВтДатыОкончанияОтпусковПоУходуЗаРебенком.Сотрудник
		|
		|       ЛЕВОЕ СОЕДИНЕНИЕ ВтДатыОкончанияПрошлыхОтпусковПоУходуЗаРебенком КАК ВтДатыОкончанияПрошлыхОтпусковПоУходуЗаРебенком
		|			ПО ОтпускаПоТрудовымДоговорам.Сотрудник = ВтДатыОкончанияПрошлыхОтпусковПоУходуЗаРебенком.Сотрудник
		|
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботниковОрганизаций КАК Состояния
		|		ПО ОтпускаПоТрудовымДоговорам.Сотрудник = Состояния.Сотрудник
		|			И (Состояния.Состояние В (&СостоянияОтпусковБезОплаты))
		|			И (Состояния.Период МЕЖДУ 
		|				  ВЫБОР 
		|					КОГДА Состояния.Состояние = ЗНАЧЕНИЕ( Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком )
		|                   	ТОГДА ISNULL( ВтДатыОкончанияПрошлыхОтпусковПоУходуЗаРебенком.ДатаНачалаОтпуска, ОтпускаПоТрудовымДоговорам.ДатаНачала )
		|						ИНАЧЕ ОтпускаПоТрудовымДоговорам.ДатаНачала
		|				  КОНЕЦ 
		|				И ВЫБОР 
		|					КОГДА Состояния.Состояние = ЗНАЧЕНИЕ( Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком )
		|                   	ТОГДА ISNULL( ВтДатыОкончанияОтпусковПоУходуЗаРебенком.ДатаОкончанияОтпуска, ДАТАВРЕМЯ( 1, 1, 1 ) )
		|						ИНАЧЕ КОНЕЦПЕРИОДА( ОтпускаПоТрудовымДоговорам.ДатаОкончания, ДЕНЬ )
		|				  КОНЕЦ 
		|			   )
		|			И Состояния.Организация = &ГоловнаяОрганизация
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтпускаПоТрудовымДоговорам.ПодразделениеОрганизации,
		|	ОтпускаПоТрудовымДоговорам.Должность,
		|	ОтпускаПоТрудовымДоговорам.Сотрудник,
		|	ОтпускаПоТрудовымДоговорам.Сотрудник.Физлицо,
		|	ОтпускаПоТрудовымДоговорам.КоличествоДней,
		|	ОтпускаПоТрудовымДоговорам.ДатаНачала,
		|	ОтпускаПоТрудовымДоговорам.ДатаОкончания,
		|	ОтпускаПоТрудовымДоговорам.ВидОтпуска
		|
		|ИМЕЮЩИЕ
		|	(СУММА(ВЫБОР
		|			КОГДА Состояния.Состояние = ЗНАЧЕНИЕ( Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком )
		|				ТОГДА РАЗНОСТЬДАТ(
		|							Состояния.Период, 
		|							Состояния.ПериодЗавершения, 
		|							ДЕНЬ ) //+ 1
		|			ИНАЧЕ 0
		|			КОНЕЦ) > 0
		|		ИЛИ СУММА(ВЫБОР
		|			КОГДА Состояния.Состояние <> ЗНАЧЕНИЕ( Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком )
		|				ТОГДА РАЗНОСТЬДАТ(
		|							Состояния.Период, 
		|							Состояния.ПериодЗавершения, 
		|							ДЕНЬ ) //+ 1
		|			ИНАЧЕ 0
		|			КОНЕЦ) - 14 > 0 )
		|
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
	    |// 5
		|ВЫБРАТЬ
		|	ВтСмещения.Сотрудник КАК Сотрудник,
		|	ВтСмещения.ФизЛицо КАК ФизЛицо,
		|	ВтСмещения.ПодразделениеОрганизации КАК Подразделение,
		|	ВтСмещения.Должность КАК Должность,
		|	ВтСмещения.ДатаИзменения КАК ДатаИзменения,
		|	ВтСмещения.КоличествоДней КАК КоличествоДней,
		|	ВтСмещения.КоличествоДней КАК НовоеКоличествоДней,
		|	ВЫБОР
		|		КОГДА ВтСмещения.СмещениеВДняхИззаОтпускаПоУходуЗаРебенком > 0
		|				И ВтСмещения.СмещениеВДняхИззаОтпускаЗаСвойСчет > 0
		|			ТОГДА ""отп.без з/п(%СмещениеВДняхИззаОтпускаЗаСвойСчет дн),отп.по уходу за реб.(%СмещениеВДняхИззаОтпускаПоУходуЗаРебенком дн)""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВтСмещения.СмещениеВДняхИззаОтпускаПоУходуЗаРебенком > 0
		|					ТОГДА ""отпуск по уходу за ребенком (%СмещениеВДняхИззаОтпускаПоУходуЗаРебенком дн.)""
		|				ИНАЧЕ ""отпуск без з/п (%СмещениеВДняхИззаОтпускаЗаСвойСчет дн.)""
		|			КОНЕЦ
		|	КОНЕЦ КАК Основание,
		|   ВтСмещения.СмещениеВДняхИззаОтпускаПоУходуЗаРебенком,
		|	ВЫБОР КОГДА ВтСмещения.СмещениеВДняхИззаОтпускаЗаСвойСчет > 0 
		|				ТОГДА ВтСмещения.СмещениеВДняхИззаОтпускаЗаСвойСчет 
		|				ИНАЧЕ 0
		|	КОНЕЦ КАК СмещениеВДняхИззаОтпускаЗаСвойСчет,
		|	ВтСмещения.ДатаНачала КАК ДатаНачала,
		|	ВтСмещения.ДатаОкончания КАК ДатаОкончания,
		|	ВтСмещения.ДатаНачала КАК ДатаНачалаНов,
		|	НАЧАЛОПЕРИОДА(
		|	  ДОБАВИТЬКДАТЕ(ВтСмещения.ДатаОкончания, ДЕНЬ, 
		|		ВЫБОР КОГДА ВтСмещения.СмещениеВДняхИззаОтпускаПоУходуЗаРебенком > 0 ТОГДА ВтСмещения.СмещениеВДняхИззаОтпускаПоУходуЗаРебенком
		|				ИНАЧЕ 0 КОНЕЦ
		|		+ ВЫБОР КОГДА ВтСмещения.СмещениеВДняхИззаОтпускаЗаСвойСчет > 0 ТОГДА ВтСмещения.СмещениеВДняхИззаОтпускаЗаСвойСчет 
		|				ИНАЧЕ 0 КОНЕЦ 
		|	  )
		|	, ДЕНЬ) КАК ДатаОкончанияНов,
		|	ВтСмещения.ДатаНачала КАК РабочийГодС,
		|	ВтСмещения.ДатаОкончания КАК РабочийГодПо,
		|	ВтСмещения.ДатаНачала КАК РабочийГодСНов,
		|	НАЧАЛОПЕРИОДА(
		|	  ДОБАВИТЬКДАТЕ(ВтСмещения.ДатаОкончания, ДЕНЬ,
		|		ВЫБОР КОГДА ВтСмещения.СмещениеВДняхИззаОтпускаПоУходуЗаРебенком > 0 ТОГДА ВтСмещения.СмещениеВДняхИззаОтпускаПоУходуЗаРебенком
		|				ИНАЧЕ 0 КОНЕЦ
		|		+ ВЫБОР КОГДА ВтСмещения.СмещениеВДняхИззаОтпускаЗаСвойСчет > 0 ТОГДА ВтСмещения.СмещениеВДняхИззаОтпускаЗаСвойСчет 
		|				ИНАЧЕ 0 КОНЕЦ 
		|	  )
		|	, ДЕНЬ) КАК РабочийГодПоНов,
		|	ВтСмещения.ВидОтпуска КАК ВидОтпуска,
		|	ВтСмещения.Сотрудник.Код КАК СотрудникКод
		|ИЗ
		|	ВтСмещения КАК ВтСмещения
		|
		|УПОРЯДОЧИТЬ ПО
		|	Подразделение,
		|	СотрудникКод,
		|	ДатаНачала,
		|	ДатаОкончания,
		|	ВидОтпуска
		|ИТОГИ
		|	СУММА(КоличествоДней)
		|ПО
		|	Сотрудник";
		

	СостоянияОтпусковБезОплаты = Новый Массив;
	ПерСост = Перечисления.СостоянияРаботникаОрганизации;
	СостоянияОтпусковБезОплаты.Добавить( ПерСост.ОтпускУчебныйНеоплачиваемый );
	СостоянияОтпусковБезОплаты.Добавить( ПерСост.ОтпускБезСохраненияЗарплатыСемейноБытовыеПричины );
	СостоянияОтпусковБезОплаты.Добавить( ПерСост.ОтпускБезСохраненияЗарплатыУчебныеСборы );
	СостоянияОтпусковБезОплаты.Добавить( ПерСост.ОтпускПоУходуЗаРебенком );
	Запрос.УстановитьПараметр("СостоянияОтпусковБезОплаты", СостоянияОтпусковБезОплаты);
	
	Запрос.УстановитьПараметр("ПериодНеявокКонец", КонецДня( ПериодНеявокПО ));
	Запрос.УстановитьПараметр("ПериодНеявокНачало", ПериодНеявокС);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ПодразделениеОрганизации", ПодразделениеОрганизации);
  	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Если Сотрудник = Неопределено Тогда
		РаботникиОрганизации.Очистить();
		Отпуска.Очистить();
	КонецЕсли; 
	
	ВыборкаРаботников = Запрос.Выполнить().Выбрать( ОбходРезультатаЗапроса.ПоГруппировкам );
	
	Пока ВыборкаРаботников.Следующий() Цикл
			
		//+ СВЭЙ КДЯ 12.12.19 СВФР-005183
		//Если ВыборкаРаботников.КоличествоДней > 0 Тогда 
		//	НовСтрРаботники = РаботникиОрганизации.Добавить();
		//КонецЕсли;
		//- СВЭЙ КДЯ 12.12.19 СВФР-005183		
	
		//+ СВЭЙ КДЯ 12.12.19 СВФР-005183
		
		//Аверсон ЕАЕ 22.04.2025 СВФР-015478
		//Если ВыборкаРаботников.КоличествоДней <= 0 Тогда 
		//    Продолжить;
		//КонецЕсли;
		//Аверсон СВФР-015478
		
		НовСтрРаботники = РаботникиОрганизации.Добавить();
		//- СВЭЙ КДЯ 12.12.19 СВФР-005183		
		
		ЭтоПервыйВидОтпуска = Истина;
		ВыборкаОтпусков = ВыборкаРаботников.Выбрать();
		Пока ВыборкаОтпусков.Следующий() Цикл
			
			//+ СВЭЙ КДЯ 12.12.19 СВФР-005183
			
			//Аверсон ЕАЕ 22.04.2025 СВФР-015478
			//Если ВыборкаОтпусков.КоличествоДней <= 0 Тогда 
			//    Продолжить;
			//КонецЕсли;
			//Аверсон СВФР-015478
			
			//- СВЭЙ КДЯ 12.12.19 СВФР-005183		
			
			НовСтрОтпуска = Отпуска.Добавить();
			ЗаполнитьЗначенияСвойств( НовСтрОтпуска, ВыборкаОтпусков, 
				"ВидОтпуска,КоличествоДней,Сотрудник,РабочийГодС,РабочийГодПо,РабочийГодСНов,РабочийГодПоНов,НовоеКоличествоДней" );
				
			Если ВыборкаОтпусков.КоличествоДней <= 0 Тогда
				ТекстОшибки = НСтр("ru='По отпуску %ВидОтпуска%, рабочий год которого требует смещения, сотрудника %Сотрудник% в остатке %КоличествоДней% количество дней'!");									
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ВидОтпуска%", ВыборкаОтпусков.ВидОтпуска);									
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Сотрудник%", ВыборкаОтпусков.Сотрудник);									
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%КоличествоДней%", ВыборкаОтпусков.КоличествоДней);
				Сообщить( ТекстОшибки, СтатусСообщения.Важное );
			КонецЕсли; 	
				
			Если ЭтоПервыйВидОтпуска Тогда
				ЗаполнитьЗначенияСвойств( НовСтрРаботники, ВыборкаОтпусков, 
					"Сотрудник,Физлицо,Подразделение,Должность,ДатаИзменения,ДатаНачала,ДатаОкончания,ДатаНачалаНов,ДатаОкончанияНов" );
					
				ОснованиеСмещения = СтрЗаменить( ВыборкаОтпусков.Основание, "%СмещениеВДняхИззаОтпускаЗаСвойСчет", ВыборкаОтпусков.СмещениеВДняхИззаОтпускаЗаСвойСчет );	
				НовСтрРаботники.Основание = СтрЗаменить( ОснованиеСмещения, "%СмещениеВДняхИззаОтпускаПоУходуЗаРебенком", ВыборкаОтпусков.СмещениеВДняхИззаОтпускаПоУходуЗаРебенком );	
				
				ЭтоПервыйВидОтпуска = Ложь;
			КонецЕсли; 
				
		КонецЦикла; // ВыборкаОтпусков.Следующий()
		
		//Если ВыборкаРаботников.КоличествоДней > 0 Тогда  //+ СВЭЙ КДЯ 12.12.19 СВФР-005183
		НовСтрРаботники.КоличествоДней = ВыборкаРаботников.КоличествоДней; 
		//КонецЕсли;                                       //+ СВЭЙ КДЯ 12.12.19 СВФР-005183
		
	КонецЦикла;  // ВыборкаРаботников.Следующий()
	
КонецПроцедуры
//(конец) добавлено Кухарчуком Д.Я. 14.09.18, Задача СВФР-002169


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШапке(Режим)

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",		Ссылка);
	Запрос.УстановитьПараметр("ПустаяОрганизация",	Справочники.Организации.ПустаяСсылка());

	Запрос.Текст =
	"ВЫБРАТЬ
	|	УстановкаКоличестваДнейОтпуска.Дата,
	|	УстановкаКоличестваДнейОтпуска.Организация,
	|	ВЫБОР
	|		КОГДА УстановкаКоличестваДнейОтпуска.Организация.ГоловнаяОрганизация = &ПустаяОрганизация
	|			ТОГДА УстановкаКоличестваДнейОтпуска.Организация
	|		ИНАЧЕ УстановкаКоличестваДнейОтпуска.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	УстановкаКоличестваДнейОтпуска.Ссылка
	|ИЗ
	|	Документ.УстановкаКоличестваДнейОтпуска КАК УстановкаКоличестваДнейОтпуска
	|ГДЕ
	|	УстановкаКоличестваДнейОтпуска.Ссылка = &ДокументСсылка";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()

// Формирует запрос по таблице "РаботникиОрганизации" документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса. В запросе данные документа дополняются данными о 
//  работниках из регистра сведений РаботникиОрганизации и о начислениях
//  и удержаниях из регистров сведений 
//
Функция СформироватьЗапросПоРаботникиОрганизации(ВыборкаПоШапкеДокумента, Режим)

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("Ссылка",				Ссылка);
    //Островская Татьяна 20.12.2013 № 16975
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	УстановкаКоличестваДнейОтпускаОтпуска.ВидОтпуска,
	|	УстановкаКоличестваДнейОтпускаОтпуска.КоличествоДней,
	|	УстановкаКоличестваДнейОтпускаРаботникиОрганизации.Сотрудник КАК Сотрудник,
	|	УстановкаКоличестваДнейОтпускаОтпуска.ВидОтпуска.Код КАК ВидОтпускаКод,
	|	УстановкаКоличестваДнейОтпускаРаботникиОрганизации.Подразделение,
	|	УстановкаКоличестваДнейОтпускаРаботникиОрганизации.Должность,
	|	УстановкаКоличестваДнейОтпускаРаботникиОрганизации.НомерСтроки,
	|	УстановкаКоличестваДнейОтпускаРаботникиОрганизации.Основание,
	|	УстановкаКоличестваДнейОтпускаРаботникиОрганизации.ДатаИзменения,
	|	УстановкаКоличестваДнейОтпускаРаботникиОрганизации.ДатаНачала,
	|	УстановкаКоличестваДнейОтпускаРаботникиОрганизации.ДатаОкончания,
	|	УстановкаКоличестваДнейОтпускаРаботникиОрганизации.ДатаНачалаНов,
	|	УстановкаКоличестваДнейОтпускаРаботникиОрганизации.ДатаОкончанияНов,
	|	УстановкаКоличестваДнейОтпускаОтпуска.РабочийГодС КАК РабочийГодСОтпуск,
	|	УстановкаКоличестваДнейОтпускаОтпуска.РабочийГодПо КАК РабочийГодПоОтпуск,
	|	УстановкаКоличестваДнейОтпускаОтпуска.РабочийГодСНов КАК РабочийГодСНовОтпуск,
	|	УстановкаКоличестваДнейОтпускаОтпуска.РабочийГодПоНов КАК РабочийГодПоНовОтпуск,
	|	УстановкаКоличестваДнейОтпускаОтпуска.НовоеКоличествоДней //Островская Татьяна 24.04.2014 № 17311
	|ИЗ
	|	Документ.УстановкаКоличестваДнейОтпуска.РаботникиОрганизации КАК УстановкаКоличестваДнейОтпускаРаботникиОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УстановкаКоличестваДнейОтпуска.Отпуска КАК УстановкаКоличестваДнейОтпускаОтпуска
	|		ПО УстановкаКоличестваДнейОтпускаРаботникиОрганизации.Сотрудник = УстановкаКоличестваДнейОтпускаОтпуска.Сотрудник
	|ГДЕ
	|	НЕ УстановкаКоличестваДнейОтпускаРаботникиОрганизации.КоличествоДней ЕСТЬ NULL 
	|	И НЕ УстановкаКоличестваДнейОтпускаОтпуска.КоличествоДней ЕСТЬ NULL 
	|	И УстановкаКоличестваДнейОтпускаРаботникиОрганизации.Ссылка = &Ссылка
	|	И УстановкаКоличестваДнейОтпускаОтпуска.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	ВидОтпускаКод";
	//Островская Татьяна 20.12.2013 № 16975
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоРаботникиОрганизации()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//  Отказ 					- флаг отказа в проведении,
//	Заголовок				- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок)

	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация!", Отказ, Заголовок);
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения реквизитов в строке ТЧ "РаботникиОрганизации" документа.
// Если какой-то из реквизтов, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по строке ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//  							  из результата запроса по товарам документа, 
//  Отказ 						- флаг отказа в проведении,
//	Заголовок					- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок)
	
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Работники организации"": ";
	
	// Сотрудник
	НетСотрудника = Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник);
	Если НетСотрудника Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не выбран сотрудник!", Отказ, Заголовок);
	КонецЕсли;
		
	Если НетСотрудника Тогда
		Возврат; // Дальше не проверяем
	КонецЕсли;
		
КонецПроцедуры // ПроверитьЗаполнениеСтрокиРаботникаОрганизации()

// Создает и заполняет структуру, содержащую имена регистров сведений
// по которым надо проводить документ
//
// Параметры: 
//	СтруктураПроведенияПоРегистрамСведений	- структура, содержащая имена регистров сведений 
//											  по которым надо проводить документ
//
// Возвращаемое значение:
//	Нет.
//
Процедура ЗаполнитьСтруктуруПроведенияПоРегистрамСведений(ВыборкаПоШапкеДокумента, СтруктураПроведенияПоРегистрамСведений)

	СтруктураПроведенияПоРегистрамСведений = Новый Структура();
	СтруктураПроведенияПоРегистрамСведений.Вставить("ОтпускаПоСотрудникам");

КонецПроцедуры // ЗаполнитьСтруктуруПроведенияПоРегистрамСведений

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры: 
//  ВыборкаПоШапкеДокумента                - выборка из результата запроса по шапке документа,
//  СтруктураПроведенияПоРегистрамСведений - структура, содержащая имена регистров 
//                                           сведений по которым надо проводить документ,
//  СтруктураПараметров                    - структура параметров проведения,
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента, ВыборкаПоРаботникиОрганизации, 
	СтруктураПроведенияПоРегистрамСведений)
	
	// Если документ нужно проводить по регистру, то для него есть ключ в структуре
	ИмяРегистра = "ОтпускаПоСотрудникам";
	Если СтруктураПроведенияПоРегистрамСведений.Свойство(ИмяРегистра) Тогда
		
		Движение = Движения[ИмяРегистра].Добавить();
		
		// Свойства
		//(начало) закомментировано Кухарчуком Д.Я. 12.07.18, Задача СВФР-002210
		//Движение.Период						= ВыборкаПоРаботникиОрганизации.РабочийГодСОтпуск;//О.Т. Аверсон 02.12.2015 № 716
		//(конец) закомментировано Кухарчуком Д.Я. 12.07.18, Задача СВФР-002210
		//(начало) добавлено Кухарчуком Д.Я. 12.07.18, Задача СВФР-002210
		Движение.Период	= ?( ВнестиИзмененияПоОтпуску, ВыборкаПоРаботникиОрганизации.РабочийГодСНовОтпуск, ВыборкаПоРаботникиОрганизации.РабочийГодСОтпуск );
		//(конец) добавлено Кухарчуком Д.Я. 12.07.18, Задача СВФР-002210
		
		// Измерения                                                             
		Движение.Сотрудник		    		= ВыборкаПоРаботникиОрганизации.Сотрудник; 
		Движение.ВидОтпуска		        	= ВыборкаПоРаботникиОрганизации.ВидОтпуска;
		// Ресурсы
		Движение.Подразделение				= ВыборкаПоРаботникиОрганизации.Подразделение;
		Движение.Должность			    	= ВыборкаПоРаботникиОрганизации.Должность;
		//(начало) закомментировано Кухарчуком Д.Я. 12.07.18, Задача СВФР-002210
		//Движение.КоличествоДней         	= ВыборкаПоРаботникиОрганизации.КоличествоДней;
		//(конец) закомментировано Кухарчуком Д.Я. 12.07.18, Задача СВФР-002210
		//(начало) добавлено Кухарчуком Д.Я. 12.07.18, Задача СВФР-002210
		Движение.КоличествоДней         	= ?( ВнестиИзмененияПоОтпуску, ВыборкаПоРаботникиОрганизации.НовоеКоличествоДней, ВыборкаПоРаботникиОрганизации.КоличествоДней );
		//(конец) добавлено Кухарчуком Д.Я. 12.07.18, Задача СВФР-002210
		Движение.Основание         	        = ВыборкаПоРаботникиОрганизации.Основание;

	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамСведений()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	
	//структура, содержащая имена регистров накопления по которым надо проводить документ
	Перем СтруктураПроведенияПоРегистрамНакопления;

	//структура, содержащая имена регистров сведений по которым надо проводить документ
	Перем СтруктураПроведенияПоРегистрамСведений;
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	Если ЭтотОбъект.Модифицированность() Тогда
		ЭтотОбъект.Записать();
	КонецЕсли;

	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке(Режим);
	
	
	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();
	Если ВыборкаПоШапкеДокумента.Следующий() Тогда
		
		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
		

		// Движения стоит добавлять, если в проведении еще не отказано (отказ =ложь)
		Если НЕ Отказ Тогда

			// Создадим и заполним структуры, содержащие имена регистров, по которым в зависимости от типа учета
			// проводится документ. В дальнейшем будем считать, что если для регистра не создан ключ в структуре,
			// то проводить по нему не надо.
			ЗаполнитьСтруктуруПроведенияПоРегистрамСведений(ВыборкаПоШапкеДокумента, СтруктураПроведенияПоРегистрамСведений);
			
			// получим реквизиты табличной части
			РезультатЗапросаПоРаботники = СформироватьЗапросПоРаботникиОрганизации(ВыборкаПоШапкеДокумента, Режим);
			ВыборкаПоСтрокамДокумента = РезультатЗапросаПоРаботники.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			// обходим строки документа
			//Островская Татьяна 12.02.2014 № 17108
			Пока ВыборкаПоСтрокамДокумента.Следующий() Цикл
				
				ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента , Отказ, Заголовок);
				
				Если НЕ Отказ Тогда
					РезультатСтарыхЗаписей = СформироватьЗапросПоОтпускамДолжностей(ВыборкаПоСтрокамДокумента.Сотрудник, ВыборкаПоСтрокамДокумента.Подразделение, ВыборкаПоСтрокамДокумента.ДатаИзменения);
					ДобавитьСтрокуВДвиженияПоРегиструОтпускаПоТрудовымДоговорам(ВыборкаПоСтрокамДокумента,ВыборкаПоШапкеДокумента,РезультатСтарыхЗаписей);//Островская Татьяна 19.12.2013 № 16975
					
				КонецЕсли;
				
			КонецЦикла;
			ВыборкаПоСтрокамДокумента = РезультатЗапросаПоРаботники.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
            //Островская Татьяна 12.02.2014 № 17108
			
			Пока ВыборкаПоСтрокамДокумента.Следующий() Цикл
				
				ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента , Отказ, Заголовок);
				
				Если НЕ Отказ Тогда
					
					ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, СтруктураПроведенияПоРегистрамСведений);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ОбщегоНазначения.ДобавитьПрефиксОрганизации(ЭтотОбъект, Префикс);
	ОбщегоНазначения.ДобавитьПрефиксУзла(Префикс);
	
	// получить новый номер документа по совокупности кадровых документов
	ПроцедурыУправленияПерсоналом.ПриУстановкеНовогоНомераКадровогоДокумента(СтандартнаяОбработка, ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "ЕдиныйНумераторКадровыхДокументов"), Номер, Префикс, Дата);
	
КонецПроцедуры // ПриУстановкеНовогоНомера()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(РаботникиОрганизации);
	
	Если ПланыОбмена.ГлавныйУзел() = Неопределено Тогда
		ЗаписьРегистрации = ПринадлежностьПоследовательностям.КадровыеПриказыОрганизации.Добавить();
		ЗаписьРегистрации.Период		= Дата;
		ЗаписьРегистрации.Регистратор	= Ссылка;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// проверим уникальность номера с точки зрения кадровой нумерации
	ПроцедурыУправленияПерсоналом.ПроверкаУникальностиНомераКадровогоДокумента(ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "ЕдиныйНумераторКадровыхДокументов"), Номер, Дата, Ссылка);

КонецПроцедуры // ПриЗаписи()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Движения.ОтпускаПоСотрудникам.Очистить();
	Движения.ОтпускаПоСотрудникам.Записать();
	
КонецПроцедуры

//Островская Татьяна 19.12.2013 № 16975
Процедура ДобавитьСтрокуВДвиженияПоРегиструОтпускаПоТрудовымДоговорам(ВыборкаПоДокументу,ВыборкаПоШапкеДокумента,РезультатСтарыхЗаписей)
	
	Движение = Движения.ОтпускаПоТрудовымДоговорам.Добавить();
	
	//Измерения
	
	если ВнестиИзмененияПоОтпуску Тогда 
		Движение.ВидДвижения    = ВидДвиженияНакопления.Расход;
		//Островская Татьяна 21.03.2014
		Движение.Период         = ВыборкаПоДокументу.РабочийГодСОтпуск;
		Движение.ДатаОкончания	= ВыборкаПоДокументу.РабочийГодПоОтпуск;
		//Островская Татьяна 21.03.2014
		Движение.Сотрудник      = ВыборкаПоДокументу.Сотрудник;
		Движение.ВидОтпуска     = ВыборкаПоДокументу.ВидОтпуска;
		//Ресурсы
		Движение.КоличествоДней = ВыборкаПоДокументу.КоличествоДней;
		Движение.Корректировка  = Истина;
		
		Движение = Движения.ОтпускаПоТрудовымДоговорам.Добавить();
		Движение.ВидДвижения    = ВидДвиженияНакопления.Приход;
		Движение.Период         = ВыборкаПоДокументу.РабочийГодСНовОтпуск;
		Движение.ДатаОкончания	= ВыборкаПоДокументу.РабочийГодПоНовОтпуск;
		Движение.Сотрудник      = ВыборкаПоДокументу.Сотрудник;
		Движение.ВидОтпуска     = ВыборкаПоДокументу.ВидОтпуска;
		//Ресурсы
		Движение.КоличествоДней = ВыборкаПоДокументу.НовоеКоличествоДней; //Островская Татьяна 24.04.2014 № 17311
		
	Иначе 
		Движение.ВидДвижения    = ВидДвиженияНакопления.Приход;
		//Островская Татьяна 21.03.2014
		Движение.Период         = ВыборкаПоДокументу.РабочийГодСОтпуск;
		Движение.ДатаОкончания	= ВыборкаПоДокументу.РабочийГодПоОтпуск;
		//Островская Татьяна 21.03.2014
		Движение.Сотрудник      = ВыборкаПоДокументу.Сотрудник;
		Движение.ВидОтпуска     = ВыборкаПоДокументу.ВидОтпуска;
		
		//Ресурсы
		Движение.КоличествоДней = ВыборкаПоДокументу.КоличествоДней;
		
	КонецЕсли;
	
	
	
	
		
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамСведений()

//Островская Татьяна 19.12.2013 № 16975
Функция СформироватьЗапросПоОтпускам(ВыборкаПоСтрокамДокумента) 
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	Запрос.УстановитьПараметр("Сотрудник" , ВыборкаПоСтрокамДокумента.Сотрудник);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УстановкаКоличестваДнейОтпуска.ВидОтпуска,
	|	УстановкаКоличестваДнейОтпуска.КоличествоДней,
	|	УстановкаКоличестваДнейОтпуска.НомерСтроки
	|ИЗ
	|	Документ.УстановкаКоличестваДнейОтпуска.Отпуска КАК УстановкаКоличестваДнейОтпуска
	|ГДЕ
	|	УстановкаКоличестваДнейОтпуска.Ссылка = &ДокументСсылка
	|	И УстановкаКоличестваДнейОтпуска.Сотрудник = &Сотрудник";
	
	Возврат Запрос.Выполнить();


КонецФункции
//Островская Татьяна 19.12.2013 № 16975

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

мДлинаСуток = 86400;
